{
  "Logging": {
    "LogLevel": {
      "Default": "Debug",
      "Microsoft": "Warning",
      "Microsoft.Hosting.Lifetime": "Information"
    }
  },
  "AppViewConfiguration": {
    "ApiKey": "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",
    "ChatGptPath": "https://api.openai.com/v1/chat/completions",
    "SpeachToTextPath": "https://api.openai.com/v1/audio/transcriptions",
    "CodeGen": "https://api.openai.com/v1/completions",
    "DefaultConnection": "Server=KARPUKKA;Database=InterviewPrepDb;;TrustServerCertificate=True; Trusted_Connection=True;",
    "TempFilePath": "C:\\Users\\troki\\Desktop\\temp",
    "WebWorkingDirectory": "E:\\Projects\\InterviewHelper\\InterviewHelper.Core\\Bat\\",
    "DiagramUrl": "http://localhost:3000/",
    "ConnectionString": "mongodb://localhost:27017",
    "DatabaseName": "interviewDb",
    "GoogleText": "E:\\Projects\\InterviewHelper\\InterviewHelper.Services\\argon-tractor-412805-d87154479e0f.json",
    "BatFilePath": "E:\\Projects\\InterviewHelper\\InterviewHelper.Diagram\\DiagramService\\"
  },
  "TextEnvironment": {
    "BaseAnswer": "Answer briefly and in simple language, modify important words or bulletpointnames  add bulletpoints. Make the text structured:",
    "CommonAnswer": "Provide a humanized answer as a Senior .NET Developer who is interviewing with the team based on this info:",
    "CodingAnswer": "Write a method in , avoiding LINQ , ordering and built-in methods if possible, no text needed, just code. Comment each code line, Solve the task with the least possible complexity to ensure optimal performance as you can, the programminglanguage is",
    "CodeFormatter": "The goal is to enhance the readability of programming code in C#, JavaScript (JS), or SQL contained within a text by adding special characters such as line breaks ( \r\n for Windows) and indents (spaces or tabs). The task involves identifying code blocks and logical sections, inserting line breaks after each statement or operator (e.g., after ; in C# and JS, and after SQL commands like SELECT, UPDATE), applying indentation for nested code blocks to reflect hierarchical structure, preserving the programming language's syntax considering string literals and comments, and keeping the original logic and functionality unchanged. Given code text for(int i=0; i<10; i++){Console.WriteLine(i);} should be formatted to improve structural presentation without altering the syntax, making it more readable and easier to analyze by applying standard code formatting practices in a textual representation. This task requires careful handling of programming language features to avoid syntax alterations while enhancing readability"
  }

}
